Autodesk.Revit.UI.SnappingServiceData.AddPointSnaps(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ})
Takes point snaps from the instance of ISnappingServer and passes them to Revit.
pointSnaps:
The points to add as snaps.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.UI.SnappingServiceData.AddLineSnaps(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Boolean)
Takes line snaps from the instance of ISnappingServer and passes them to Revit.
lineSnaps:
Lines are represented by two XYZs: first an origin, then a direction.
projectToWorkPlane:
Whether to project the lines to the work plane. For instance, if the line snaps represent
planes, we want to project them. If they represent cylinders, we do not. If we project
to the work plane, we also verify that the line is parallel to the work plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the array lineSnaps has an odd number of entries and is hence not a valid line snap
array, since lines are represented as an origin XYZ followed by a direction XYZ.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL